///////////////////////////////////////////////////////////////////-=505-Tech=-///
//电赛H题-模拟电磁曲射炮
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//版本：V3.0
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//电赛第六组
//组员：丁  涛  何冠祥  徐天泽
//中国民航大学电子科技创新创业实践基地505创客实验室
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//本程序仅供学习参考，未经许可，不得用于其它任何用途
///////////////////////////////////////////////////////////////////-=505-Tech=-///
#include "main.h"
#include "menu.h"
#include "control.h"
///////////////////////////////////////////////////////////////////-=505-Tech=-///
extern MENU_PAGE Homepage;
///////////////////////////////////////////////////////////////////-=505-Tech=-///
void Program(void);
void JTAGDisable(void);
/********************************************************************************
  功能：	主函数
  参数：	无
  返回：	无
  备注：	存放各种初始化代码，显示菜单
*********************************************************************************/
int main()
{
  delay_init();                                      //延时初始化，函数内部初始化了时钟
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);    //2位抢占优先级，2位响应优先级
  JTAGDisable();                                     //禁用JTAG
	
  uart_init(115200);                                 //串口1初始化
	USART2_Init(19200);                                //串口2初始化
//	USART3_Init(9600);                                 //串口3初始化
  TIM6_Interrupt_Init();                             //定时器6定时中断初始化
  LED_Init();                                        //LED初始化
	BEEP_Init();                                       //蜂鸣器初始化
  KEY_Init();                                        //按键初始化
  OLED_Init();                                       //OLED初始化
  TIM1_PWM_Init();                                   //定时器1PWM输出初始化
	RELAY_Init();                                      //继电器初始化
//	ADC1_Init();                                       //ADC初始化
	
  DATA_Load();                                       //从flash中加载数据
  
  OLED_ShowLogo();                                   //展示505_Tech的LOGO
	BEEP_Hint(2);                                      //蜂鸣器蜂鸣两次
  
  SOLGUI_Init(&Homepage);                            //菜单初始化
	
  while(1)
  {
		uint8_t  key_value;
		
    key_value=KEY_Scan();														//键值获取
		
    if(key_value==__KEY_USER)                       //User用作OLED复位
		{
			OLED_Init();
		}

    SOLGUI_InputKey(key_value);											//键值输入
    SOLGUI_Menu_PageStage();												//计算前台
    SOLGUI_Refresh();																//更新屏幕
    
    Program();                                      //主函数中除菜单显示外的其它代码
  }
}
/********************************************************************************
  功能：	主函数中除菜单显示外的其它代码
  参数：	无
  返回：	无
  备注：	过于冗长的代码会降低菜单显示速度，建议以其它方式实现，如将程序放到中断中
*********************************************************************************/
void Program()
{
    LED1_Flash(100);
}
/********************************************************************************
  功能：	禁用JTAG
  参数：	无
  返回：	无
  备注：	禁用JTAG调试，释放PA15、PB3、PB4
*********************************************************************************/
void JTAGDisable()
{
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
}
/********************************************************************************
  功能：	保佑代码无BUG
  参数：	无
  返回：	无
  备注：	心诚则灵
*********************************************************************************/
//                                    _ooOoo_	
//                                   o8888888o
//                                   88" . "88
//                                   (| -_- |)
//                                   O\  =  /O
//                                ____/`---'\____
//                              .'  \\|     |//  `.
//                             /  \\|||  :  |||//  \
//                            /  _||||| -:- |||||-  \
//                            |   | \\\  -  /// |   |
//                            | \_|  ''\---/''  |   |
//                            \  .-\__  `-`  ___/-. /
//                      =======|. .'  /--.--\  `. .|=======
//                     ==."" '<  `.___\_<|>_/___.'  >'"".===
//                    ==| | :  ` - `.;`\ _ /`;.`/ - ` : | |==
//                   ===\  \ `-.   \_ __\ /__ _/   .-` /  /===
//                  =====`-.____`-.___\_____/___.-`____.-'=====
//                 ===================`=---='===================
//                ===============================================
///////////////////////////////////////////////////////////////////-=505-Tech=-///
